#*****************my text 
Texts={ 
   'help_text'          : " راهنمای ربات: \n",
   'main_menu'          : " لطفا از منو زیر انتخاب کنید:" ,
   'member'             : "✖️ لطفا ابتدا عضو کانال شوید ✖️",
   'products_cat'       : "دسته بندی محصولات:" ,
   'basket'             : "سبد خرید شما: 🛒 \nسبدخرید شما درحال حاضر خالی است. ✖️ \nبرای خرید از منو محصولات مورد نظر خود را انتخاب کنید.",
   'basket_buy'         : "سبد خرید شما: 🛒 \n",
   'search'             : "لطفا نام محصول موردنظر خود را وارد کنید 🔎 :" ,
   'search_not'         : "محصول مورد نظر پیدا نشد ✖️",
   'order'              : "لطفا کد سفارش خود را وارد کنید:" ,
   'help_robot'         : "❓ راهنمای استفاده از ربات:",
   'welcome'            : "🌸 سلام عزیزم 🌸\nبه ربات فروشگاهی شیدا خوش آمدی. میتونی ظروف آشپزخانه ببینی و خرید مطمئن و راحت داشته باشی.",
   'back'               : "🔙 بازگشت",
   'link_chanel'        : "لینک دعوت:  https://t.me/sheida_home_bot?start=value",
   'reply'              : "پاسخ دادن",
   'supporter'          : "پیام خود را برای پشتیبانی ارسال کنید:",
   'forward_su'         :"✔️ پیام شما برای  پشتیبانی ارسال شد ✔️",
   'answer_ad'          : "پاسخ خود را ارسال کنید:",
   'answer_su'          : "پیام ارسال شد ✔️",
   'admin_answer'       : "برای پاسخ به کاربر روی دکمه زیر بزنید",
   'answer'             : "پاسخ ارسال شد ✔️",
   'close_forward'      : "✖️ Forward کاربر بسته است ✖️ \n برای پاسخ دادن از دکمه زیر استفاده کنید.",
   'category'              :'''✔️ شما {category} را انتخاب کردید \n     برای دیدن جزئیات بیشتر محصول مورد نظر را انتخاب کنید: ''',
   'add_product'        : '''لطفا عکس محصول را به همراه اطلاعات زیر ارسال کنید: \n
name: نام
desc: توضیحات
price: قیمت
inventory: موجودی 
category: دسته بندی  ''',

   'add_basket'         :"اضافه کردن به سبدخرید",
   'zero'               : "نمیتواند 0 باشد",
   'add_succsfuly'      : "محصول به سبد خرید اضافه شد ✔️",
   'add'                : "اضافه شد",
   'see_product'        : " 🔍 دیدن محصول",
   'new_product'        : '''✔️ شما جدیدترین محصولات را انتخاب کردید \n     برای دیدن جزئیات بیشتر محصول مورد نظر را انتخاب کنید: ''',
   'hendel_basket'      :'''🛍 راهنمای افزودن محصول به سبد خرید:\n\n1️⃣ از منوی اصلی وارد بخش «محصولات» شوید.\n
2️⃣ دسته‌بندی موردنظر خود را انتخاب کنید.\n\n3️⃣ روی شماره محصول موردنظر بزنید.\n
4️⃣ صفحه جزئیات محصول نمایش داده می‌شود که می‌توانید موارد زیر را مشاهده کنید:\n📌 نام محصول\n📝 توضیحات\n💰 قیمت\n📦 موجودی\n🏷 دسته‌بندی\n
5️⃣ تعداد موردنظر خود را با دکمه‌های زیر محصول مشخص کنید:
➖ کاهش تعداد  |  🔢 تعداد انتخاب‌شده  |  ➕ افزایش تعداد\n
6️⃣ پس از انتخاب تعداد موردنظر، روی دکمه «🛒 افزودن به سبد خرید» بزنید.
✅ محصول با همان تعدادی که انتخاب کرده‌اید به سبد خرید اضافه می‌شود.\n
7️⃣ برای مشاهده محصولات انتخاب‌شده، از منوی اصلی وارد « سبد خرید» شوید.''',

   'hendel_invite' : '''راهنمای دعوت دوستان و آشنایان 👥  :\n\n1️⃣ از منوی اصلی وارد بخش «دعوت دوستان» شوید.\n
2️⃣ در این بخش، لینک دعوت در اختیار شما قرار می‌گیرد که می‌توانید  آن را برای دوستان و آشنایان خود ارسال کنید.\n
3️⃣ دوستان شما می‌توانند با استفاده از این لینک وارد ربات شوند و از امکانات آن استفاده کنند.\n\n
🎁 با دعوت دوستان خود، آن‌ها را با فروشگاه و محصولات ما آشنا کنید.''',

   'edit_name'          : "ویرایش نام",
   'edit_phone'         : "ویرایش شماره موبایل",
   'edit_address'       : "ویرایش آدرس",
   'informarion'        : "لطفا اطلاعات خود را درست تکمیل کنید",
   'new_name'           : "نام  خود را کامل کنید:",
   'new_phone'          : "شماره موبایل خود را کامل کنید:",
   'new_address'        : "آدرس خود را کامل کنید:",
   'change_ok'          : "با موفقیت ذخیره شد ✔️",
   'not_complit'        : "✖️",
   'un_phone'           : " ✖️ لطفا شماره موبایل خود را درست وارد کنید",
   'send_phone'         : "ارسال شماره تلفن",
   'cancel'             : "لغو",
   'cancel_text'        : "لغو عملیات",
   'menu_asli'          : "منو اصلی",
   'menu_product'       : "منو محصولات",
   'join_ch'            : "عضویت در کانال",
   'join'               : "عضو شدم",
   'gu_add'             : "افزودن محصول به سبدخرید",
   'gu_search'          : "جست و جوی محصول مورد نظر",
   'gu_order'           : "پیگیری سفارش",
   'gu_factor'          : "ثبت سفارش",
   'gu_profile'         : "تکمیل اطلاعات پروفایل",
   'gu_store'           : "درباره فروشگاه",
   'gu_invite'          : "دعوت دوستان و آشنایان",
   'support'            : "پشتیبانی 🗣",
   'edit_information'   : "ویرایش اطلاعات ✏️",
   'orders_history'     : "تاریخچه سفارشات 📄",
   'edit_orders'        : "ویرایش سفارشات ✏️",
   'delete_pro'         : "حذف کامل از سبد خرید",
   'back_basket'        : " بازگشت به سبدخرید🔙",
   'delete_complete'    : "❌لطفا حذف کامل محصول را بزنید❌",
   'delete_pro_cart'    : "محصول کامل حذف شد",
   'factor_order'       : "فاکتور سفارش شما 📄",
   'empty_cart'         : "سبدخرید خالی است ❌",
   'address_store'      :  'میدان شوش , خیابان صابونیان , خیابان کاخ جوانان , پاساژ نور , طبقه اول , پلاک ۴۲۲',
   'card_name'          : "نادیا کریمی خواه",
   'send_receipt'       : "ارسال رسید ",
   'receipt'            : "لطفا عکس رسید پرداخت را ارسال کنید:",
   'check_receipt'      : " رسید شما ارسال شد ✔️",
   'order'              : "سفارش شما در انتظار بررسی پرداخت است",
   'no_order'           : "شما هنوز سفارشی ثبت نکردید",
   'hendel_search'      : '''🔎 راهنمای جستجوی محصول: \n\n1️⃣ از منوی اصلی وارد بخش «جستجوی محصول» شوید.\n
2️⃣ نام محصول موردنظر یا بخشی از نام آن را برای ربات ارسال کنید.\n
3️⃣ ربات محصولات مرتبط با عبارت جستجو را برای شما نمایش می‌دهد.\n
4️⃣ محصول موردنظر خود را از بین نتایج انتخاب کنید.\n
5️⃣ پس از انتخاب محصول، صفحه جزئیات آن نمایش داده می‌شود که می‌توانید موارد زیر را مشاهده کنید:\n📌 نام محصول\n📝 توضیحات\n💰 قیمت
📦 موجودی\n🏷 دسته‌بندی\n
6️⃣ در صورت تمایل، تعداد موردنظر را انتخاب کرده و محصول را به سبد خرید اضافه کنید.\n
7️⃣ برای مشاهده محصولات انتخاب‌شده، از منوی اصلی وارد بخش «سبد خرید» شوید.''',

   'hendel_order'       :'''📦 راهنمای پیگیری سفارش:\n\n1️⃣ از منوی اصلی وارد بخش «پیگیری سفارش» شوید.\n
2️⃣ در این بخش، وضعیت سفارش ثبت‌شده شما نمایش داده می‌شود.\n
3️⃣ اگر رسید پرداخت خود را ارسال کرده باشید، وضعیت سفارش به صورت زیر نمایش داده می‌شود:\n🟡 در انتظار بررسی پرداخت\n
4️⃣ پس از بررسی و تأیید پرداخت، وضعیت سفارش شما در همین بخش به‌روزرسانی خواهد شد.\n
5️⃣ برای اطلاع از آخرین وضعیت سفارش، می‌توانید هر زمان وارد بخش «پیگیری سفارش» شوید.''',

   'hendel_saved'       :'''🧾 راهنمای ثبت سفارش:\n\n1️⃣ از منوی اصلی وارد بخش «سبد خرید» شوید.\n
2️⃣ محصولات و تعداد موردنظر خود را بررسی کنید.\n\n3️⃣ روی دکمه «🧾 ثبت سفارش» بزنید.\n
4️⃣ فاکتور سفارش شما ایجاد و برایتان ارسال می‌شود.\n
5️⃣ مبلغ قابل پرداخت و اطلاعات کارت برای شما نمایش داده می‌شود.\n
6️⃣ مبلغ سفارش را به شماره کارت اعلام‌شده واریز کنید.\n
7️⃣ پس از پرداخت، روی دکمه «📤 ارسال رسید» بزنید و تصویر رسید پرداخت را ارسال کنید.\n
8️⃣ پس از ارسال رسید، وضعیت سفارش شما در بخش «📦 پیگیری سفارش» به صورت «🟡 در انتظار بررسی پرداخت» نمایش داده می‌شود.''',

   'hendel_profile'     : '''👤 راهنمای تکمیل اطلاعات پروفایل:\n\n1️⃣ از منوی اصلی وارد بخش «پروفایل» شوید.\n
2️⃣ در این بخش اطلاعات حساب کاربری خود را مشاهده می‌کنید.\n
3️⃣ برای تکمیل اطلاعات، می‌توانید نام، شماره تلفن و آدرس خود را وارد کنید.\n
4️⃣ اطلاعات واردشده در پروفایل شما ذخیره می‌شود.\n
5️⃣ تکمیل اطلاعات پروفایل باعث می‌شود هنگام ثبت سفارش، اطلاعات موردنیاز شما در فاکتور ثبت شود.\n
6️⃣ برای تغییر اطلاعات خود، دوباره وارد بخش «پروفایل» شوید و اطلاعات جدید را وارد کنید.''',

   'hendel_shop'        :'''🏪 راهنمای درباره فروشگاه:\n
🛍 در فروشگاه می‌توانید محصولات مختلف را مشاهده و جستجو کنید، محصولات موردنظر خود را به سبد خرید اضافه کرده و سفارش خود را ثبت کنید.''',


  }