#*****************my text 
Texts={ 
   'help_text'          : " راهنمای ربات: \n",
   'main_menu'          : " لطفا از منو زیر انتخاب کنید:" ,
   'member'             : "✖️ لطفا ابتدا عضو کانال شوید ✖️",
   'products_cat'       : "دسته بندی محصولات:" ,
   'basket'             : "سبد خرید شما: 🛒 \nسبدخرید شما درحال حاضر خالی است. ✖️ \nبرای خرید از منو محصولات مورد نظر خود را انتخاب کنید.",
   'basket_buy'         : "سبد خرید شما: 🛒 \n",
   'search'             : "لطفا نام محصول موردنظر خود را وارد کنید 🔎 :" ,
   'search_not'         : "محصول مورد نظر پیدا نشد ✖️",
   'order'              : "لطفا کد سفارش خود را وارد کنید:" ,
   'help_robot'         : "❓ راهنمای استفاده از ربات:",
   'welcome'            : "🌸 سلام عزیزم 🌸\nبه ربات فروشگاهی شیدا خوش آمدی. میتونی ظروف آشپزخانه ببینی و خرید مطمئن و راحت داشته باشی.",
   'back'               : "🔙 بازگشت",
   'link_chanel'        : "لینک دعوت:  https://t.me/sheida_home_bot?start=value",
   'reply'              : "پاسخ دادن",
   'supporter'          : "پیام خود را برای پشتیبانی ارسال کنید:",
   'forward_su'         :"✔️ پیام شما برای  پشتیبانی ارسال شد ✔️",
   'answer_ad'          : "پاسخ خود را ارسال کنید:",
   'answer_su'          : "پیام ارسال شد ✔️",
   'admin_answer'       : "برای پاسخ به کاربر روی دکمه زیر بزنید",
   'answer'             : "پاسخ ارسال شد ✔️",
   'close_forward'      : "✖️ Forward کاربر بسته است ✖️ \n برای پاسخ دادن از دکمه زیر استفاده کنید.",
   'category'              :'''✔️ شما {category} را انتخاب کردید \n     برای دیدن جزئیات بیشتر محصول مورد نظر را انتخاب کنید: ''',
   'add_product'        : '''لطفا عکس محصول را به همراه اطلاعات زیر ارسال کنید: \n
name: نام
desc: توضیحات
price: قیمت
inventory: موجودی 
category: دسته بندی  ''',

   'add_basket'         :"اضافه کردن به سبدخرید",
   'zero'               : "نمیتواند 0 باشد",
   'add_succsfuly'      : "محصول به سبد خرید اضافه شد ✔️",
   'add'                : "اضافه شد",
   'see_product'        : " 🔍 دیدن محصول",
   'new_product'        : '''✔️ شما جدیدترین محصولات را انتخاب کردید \n     برای دیدن جزئیات بیشتر محصول مورد نظر را انتخاب کنید: ''',
   'hendel_basket'      :'''🛍 راهنمای افزودن محصول به سبد خرید:\n\n1️⃣ از منوی اصلی وارد بخش «محصولات» شوید.\n
2️⃣ دسته‌بندی موردنظر خود را انتخاب کنید.\n\n3️⃣ روی شماره محصول موردنظر بزنید.\n
4️⃣ صفحه جزئیات محصول نمایش داده می‌شود که می‌توانید موارد زیر را مشاهده کنید:\n📌 نام محصول\n📝 توضیحات\n💰 قیمت\n📦 موجودی\n🏷 دسته‌بندی\n
5️⃣ تعداد موردنظر خود را با دکمه‌های زیر محصول مشخص کنید:
➖ کاهش تعداد  |  🔢 تعداد انتخاب‌شده  |  ➕ افزایش تعداد\n
6️⃣ پس از انتخاب تعداد موردنظر، روی دکمه «🛒 افزودن به سبد خرید» بزنید.
✅ محصول با همان تعدادی که انتخاب کرده‌اید به سبد خرید اضافه می‌شود.\n
7️⃣ برای مشاهده محصولات انتخاب‌شده، از منوی اصلی وارد « سبد خرید» شوید.''',

   'hendel_invite' : '''راهنمای دعوت دوستان و آشنایان 👥  :\n\n1️⃣ از منوی اصلی وارد بخش «دعوت دوستان» شوید.\n
2️⃣ در این بخش، لینک دعوت در اختیار شما قرار می‌گیرد که می‌توانید  آن را برای دوستان و آشنایان خود ارسال کنید.\n
3️⃣ دوستان شما می‌توانند با استفاده از این لینک وارد ربات شوند و از امکانات آن استفاده کنند.\n\n
🎁 با دعوت دوستان خود، آن‌ها را با فروشگاه و محصولات ما آشنا کنید.''',

   'edit_name'          : "ویرایش نام",
   'edit_phone'         : "ویرایش شماره موبایل",
   'edit_address'       : "ویرایش آدرس",
   'informarion'        : "لطفا اطلاعات خود را درست تکمیل کنید",
   'new_name'           : "نام  خود را کامل کنید:",
   'new_phone'          : "شماره موبایل خود را کامل کنید:",
   'new_address'        : "آدرس خود را کامل کنید:",
   'change_ok'          : "با موفقیت ذخیره شد ✔️",
   'not_complit'        : "✖️",
   'un_phone'           : " ✖️ لطفا شماره موبایل خود را درست وارد کنید",
   'send_phone'         : "ارسال شماره تلفن",
   'cancel'             : "لغو",
   'cancel_text'        : "لغو عملیات",
   'menu_asli'          : "منو اصلی",
   'menu_product'       : "منو محصولات",
   'join_ch'            : "عضویت در کانال",
   'join'               : "عضو شدم",
   'gu_add'             : "افزودن محصول به سبدخرید",
   'gu_search'          : "جست و جوی محصول مورد نظر",
   'gu_order'           : "پیگیری سفارش",
   'gu_factor'          : "ثبت سفارش",
   'gu_profile'         : "تکمیل اطلاعات پروفایل",
   'gu_store'           : "درباره فروشگاه",
   'gu_invite'          : "دعوت دوستان و آشنایان",
   'support'            : "پشتیبانی 🗣",
   'edit_information'   : "ویرایش اطلاعات ✏️",
   'orders_history'     : "تاریخچه سفارشات 📄",
   'edit_orders'        : "ویرایش سفارشات ✏️",
   'delete_pro'         : "حذف کامل از سبد خرید",
   'back_basket'        : " بازگشت به سبدخرید🔙",
   'delete_complete'    : "❌لطفا حذف کامل محصول را بزنید❌",
   'delete_pro_cart'    : "محصول کامل حذف شد",
   'factor_order'       : "فاکتور سفارش شما 📄",
   'empty_cart'         : "سبدخرید خالی است ❌",

  }